'''
    题目:企业发放的奖金根据利润提成。利润(i)低于或等于10万元时，奖金可提10%;
    利润高于于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%;
    20万到40万之.间时，高于20万元的部分，可提成5%;
    40 万到60万之间时高于40万元的部分,可提成3%;
    60万到100万之间时，高于60万元的部分,可提成1.5%；
    高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润i,求应发放奖金总数?
'''
m=int(input("输入工资："))
if m<=100000 :
    print(m*0.1)
elif 100000<m<=200000:
    print(100000*0.1+(m-100000)*0.075)
elif 200000<m<=400000:
    print(100000*0.1+100000*0.075+(m-200000)*0.05)
elif 400000<m<=600000:
    print (100000 * 0.1+100000*0.075+200000*0.05+(m - 400000) * 0.03)
elif 600000<m<=1000000:
    print (100000 * 0.1+100000*0.075+200000*0.05+200000* 0.03+(m-600000)*0.015)
elif 1000000<m:
    print (100000 * 0.1+100000*0.075+200000*0.05+200000* 0.03+400000*0.015+(m-1000000)*0.01)